Tekla.Structures.Drawing.PluginPickerInput
The PluginPickerInput class represents a predefined set of picker inputs that can be provided
to a plug-in object. It replaces the interactive selection of points and/or objects by the user
when the plug-in is inserted into a drawing through the API.

Tekla.Structures.Drawing.PluginPickerInput.Inputs
Gets or sets the picker inputs.

Tekla.Structures.Drawing.PluginPickerInput.#ctor
Initializes a new instance of the PluginPickerInput class with an empty list of picker inputs.

Tekla.Structures.Drawing.PluginPickerInput.#ctor(System.Collections.Generic.List{Tekla.Structures.Drawing.PickerInput})
Initializes a new instance of the PluginPickerInput class which contains a predefined sequence
of inputs.
inputs: The sequence of picker inputs.

Tekla.Structures.Drawing.PluginPickerInput.Add(Tekla.Structures.Drawing.PickerInput)
Appends a picker input to the plug-in input.
input: The picker input to append.

Tekla.Structures.Drawing.PluginPickerInput.AddRange(System.Collections.Generic.List{Tekla.Structures.Drawing.PickerInput})
Appends several picker inputs to the picker input sequence.
inputs:
All elements of the collection passed in the parameter will be appended in the same order
to the plug-in input.